cristianoag/esp32_clones/software/esp32_msx_emulator/lib/MsxSoftUsb/upstream/usb_host.c
#ifdef DEBUG_ALL
uint16_t debug_buff[0x100];
#endif



int parse_received_NRZI_buffer()
{
#ifdef MSX_SOFT_USB
  uint8_t bytes[16];
  unsigned length = 0;
  int result = msx_usb_decode_edges(received_NRZI_buffer, received_NRZI_buffer_bytesCnt,
                                    M_ONE, P_ONE, TIME_MULT, bytes, sizeof(bytes), &length);
  if(result == T_ACK || result == T_NACK || result == T_STALL || result == T_NEED_ACK)
    for(unsigned i = 0; i < length; ++i) decoded_receive_buffer_put(bytes[i]);
  return result;
#else
  if(!received_NRZI_buffer_bytesCnt) return 0;

  uint32_t   crcb;
  uint32_t   rem;

  crcb = 0b1000000000000101;
  rem =  0b1111111111111111;

  int  res = 0;
  int  cntOnes = 0;

  int terr  = 0;
  uint8_t  current_res = 0xfe;
  uint16_t prev = received_NRZI_buffer[0];
  int      start = -1;
  uint8_t  prev_smb = M_ONE;
#ifdef DEBUG_ALL
  debug_buff[0] = received_NRZI_buffer_bytesCnt;
  uint8_t rcnt = 1;
  debug_buff[received_NRZI_buffer_bytesCnt] = 0xff;
#endif
  for(int i = 1;i<received_NRZI_buffer_bytesCnt;i++) {
    //define 2.5
    uint16_t curr = (prev&0xff00) + (((received_NRZI_buffer[i] - prev))&0xff);
    prev          = received_NRZI_buffer[i];

    uint8_t smb = curr>>8;
    int tm = (curr&0xff);
    //debug_buff[i] = tm | (smb<<8);
    if( tm<2  || (smb == 0) ) {
      //terr+=tm<4?tm : 4;
      terr+=tm;
    } else {
      //terr = 0;
      int delta = ((((curr+terr)&0xff))*TIME_MULT+TIME_SCALE/2)/TIME_SCALE;

      for(int k=0;k<delta;k++) {
        int incc = 1;

        if(prev_smb!=smb) {
          if(cntOnes!=6) {
            current_res = current_res*2+0;
          } else {
            incc = 0;
          }
          cntOnes = 0;
        } else {
          current_res = current_res*2+1;
          cntOnes++;
        }
        if(start>=0) {
          start+=incc;
        }
        if(current_res==0x1 && start<0 ) {
          start = 0;
        }
        if( (start&0x7) == 0 && incc) {
          if(start==8) {
            res = current_res;
          }
          #ifdef DEBUG_ALL
            debug_buff[rcnt++] = current_res;
          #endif
          decoded_receive_buffer_put(current_res);
          if(start>8) {
            for(int bt =0;bt<8;bt++) {
              int rb = (rem>>15)&1;
              rem   =  (rem<<1)&0b1111111111111111;
              if(rb^((current_res>>(7-bt))&1)) {
                rem ^= crcb;
              }
            }
          }
        }

        prev_smb = smb;
      }
      terr = 0;
    }
  }
  #ifdef DEBUG_ALL
    debug_buff[rcnt++] = 0xff;
  #endif
  rem &=0b1111111111111111;
  if (rem==0b1111111111111111) {
    return res;
  }
  if(rem==0x800d) {
    return  T_NEED_ACK;
  } else {
    return  T_CHK_ERR;
  }
#endif
}



//#define WR_SIMULTA
#ifdef MSX_SOFT_USB
/* Packet transactions run with interrupts masked by the host task. Keep the
 * entire bit loop in IRAM; flash/cache stalls must not change the wire rate. */
void IRAM_ATTR __attribute__((noinline)) sendOnly()
{
  const unsigned count = transmit_NRZI_buffer_cnt;
  const uint32_t period = msxBitCycles;
  const uint32_t dm = DM_PIN_M, dp = DP_PIN_M;
  SET_O;
  uint32_t deadline = cpu_hal_get_cycle_count() + period;
  for(unsigned k = 0; k < count; ++k) {
    const unsigned state = transmit_NRZI_buffer[k];
    volatile uint32_t *dmRegister = snd[state][0];
    volatile uint32_t *dpRegister = snd[state][1];
    while(msx_usb_before_deadline(cpu_hal_get_cycle_count(), deadline)) {}
    *dmRegister = dm;
    *dpRegister = dp;
    deadline += period;
  }
  /* Hold the last J for one bit after two SE0 bits, then release immediately
   * so reception starts before the device's earliest permitted response. */
  while(msx_usb_before_deadline(cpu_hal_get_cycle_count(), deadline)) {}
  SET_I;
  transmit_NRZI_buffer_cnt = 0;
}
#else
void sendOnly()
{
  uint8_t k;
  SET_O;
  #ifdef WR_SIMULTA
    uint32_t out_base = GPIO.out;
    sndA[0] = (out_base | DP_PIN_M) &~DM_PIN_M;
    sndA[1] = (out_base | DM_PIN_M) &~DP_PIN_M;
    sndA[2] = (out_base )&~(DP_PIN_M | DM_PIN_M);
    sndA[3] =  out_base | (DM_PIN_M | DP_PIN_M);
  #endif
  for(k=0;k<transmit_NRZI_buffer_cnt;k++) {
    //usb_transmit_delay(10);
    cpuDelay();
    #ifdef WR_SIMULTA
      GPIO.out = sndA[transmit_NRZI_buffer[k]];
    #else
      *snd[transmit_NRZI_buffer[k]][0] = DM_PIN_M;
      *snd[transmit_NRZI_buffer[k]][1] = DP_PIN_M;
    #endif
  }
  restart();
  SET_I;
}
#endif


#ifdef MSX_SOFT_USB
extern uint8_t ACK_BUFF[0x20];
extern int ACK_BUFF_CNT;

static void IRAM_ATTR msxAckData(uint32_t eopStart)
{
  /* EOP is two SE0 bits plus J. sendOnly adds the packet's leading idle J;
   * wait here so ACK SYNC begins after EOP, not while SE0 is still driven. */
  const uint32_t ready = eopStart + msxBitCycles * 3;
  for(int i = 0; i < ACK_BUFF_CNT; ++i) transmit_NRZI_buffer[i] = ACK_BUFF[i];
  transmit_NRZI_buffer_cnt = ACK_BUFF_CNT;
  while(msx_usb_before_deadline(cpu_hal_get_cycle_count(), ready)) {}
  sendOnly();
}

void IRAM_ATTR __attribute__((noinline)) sendRecieveNParse()
{
  /* Preload receive state and remain in IRAM across TX/RX turnaround. */
  const uint32_t mask = RD_MASK;
  const unsigned shift = RD_SHIFT;
  const uint32_t timeout = msxBitCycles * 12;
  msx_usb_capture_t capture;
  msxReplayAcked = false;
  sendOnly();
  const uint32_t pins = GPIO.in & mask;
  msx_usb_capture_begin(&capture, received_NRZI_buffer, pins, shift,
                        cpu_hal_get_cycle_count(), timeout);
  while(msx_usb_capture_sample(&capture, GPIO.in & mask, cpu_hal_get_cycle_count())) {}
  received_NRZI_buffer_bytesCnt = capture.count;
  /* The first copy was CRC-validated without an ACK. Acknowledge its replay
   * like CP400, then deliver that validated copy rather than the replay. */
  if(msxAcknowledgeReplay && !capture.overflow && !capture.pins &&
     capture.count >= SMALL_NO_DATA / 2) {
    msxAckData(capture.lastEdge);
    msxReplayAcked = true;
  }
}
#else
void sendRecieveNParse()
{
  register uint32_t _R3;
  register uint16_t *STORE = received_NRZI_buffer;
  //__disable_irq();
  sendOnly();
  register uint32_t _R4;// = READ_BOTH_PINS;

START:
  _R4 = READ_BOTH_PINS;
  *STORE = _R4 | _getCycleCount8d8();
  STORE++;
  _R3 = _R4;
  //_R4 = READ_BOTH_PINS;
  //if(_R4!=_R3)  goto START;
  if( _R3 ) {
    for(int k=0;k<TOUT;k++) {
      _R4   = READ_BOTH_PINS;
      if(_R4!=_R3)  goto START;
    }
  }
  //__enable_irq();
  received_NRZI_buffer_bytesCnt = STORE-received_NRZI_buffer;
}
#endif



int sendRecieve()
{
  sendRecieveNParse();
  return parse_received_NRZI_buffer();
}



