cristianoag/esp32_clones/software/esp32_msx_emulator/lib/MsxSoftUsb/upstream/usb_host.c
void SOF()
{
  if(1) {
    repack();
  }
  sendOnly();
}



void pu_Addr(uint8_t cmd,uint8_t addr,uint8_t eop)
{
  pu_MSB(T_START,8);
  pu_MSB(cmd,8);//setup
  pu_LSB(addr,7);
  pu_LSB(eop,4);
  pu_MSB(cal5(),5);
  repack();
}



void pu_ShortCmd(uint8_t cmd)
{
  pu_MSB(T_START,8);
  pu_MSB(cmd,8);//setup
  pu_MSB(0,16);
  repack();
}



void pu_Cmd(uint8_t cmd,uint8_t bmRequestType, uint8_t bmRequest,uint16_t wValue,uint16_t wIndex,uint16_t wLen)
{
  pu_MSB(T_START,8);
  pu_MSB(cmd,8);//setup
  pu_LSB(bmRequestType,8);
  pu_LSB(bmRequest,8);
  pu_LSB(wValue,16);
  pu_LSB(wIndex,16);
  pu_LSB(wLen,16);
  pu_MSB(cal16(),16);
  repack();
}



uint8_t ACK_BUFF[0x20];
int ACK_BUFF_CNT = 0;


void ACK()
{
  transmit_NRZI_buffer_cnt = 0;
  if(ACK_BUFF_CNT==0) {
    pu_MSB(T_START,8);
    pu_MSB(T_ACK,8);// ack
    repack();
    memcpy(ACK_BUFF,transmit_NRZI_buffer,transmit_NRZI_buffer_cnt);
    ACK_BUFF_CNT = transmit_NRZI_buffer_cnt;
  } else {
    memcpy(transmit_NRZI_buffer,ACK_BUFF,ACK_BUFF_CNT);
    transmit_NRZI_buffer_cnt = ACK_BUFF_CNT;
  }
  sendOnly();
}


void timerCallBack()
{
  decoded_receive_buffer_clear();

  if(current->cb_Cmd==CB_CHECK) {
    SET_I;
    current->wires_last_state = READ_BOTH_PINS>>8;
    if(current->wires_last_state==M_ONE) {
      // low speed
      hid_device_connected = true;
      current->connected = true;
    } else if(current->wires_last_state==P_ONE) {
      // full speed (not supported by this low-speed transport)
      hid_device_connected = true;
      current->connected = true;
    } else if(current->wires_last_state==0x00) {
      // not connected
      hid_device_connected = false;
      current->connected = false;
    } else if(current->wires_last_state== (M_ONE + P_ONE) ) {
      //????
    }
    current->bComplete = 1;
  } else if (current->cb_Cmd==CB_RESET) {
    SOF();
    sendRecieveNParse();
    SET_O;
    SE_0;
    current->cmdTimeOut  =   31;
    current->cb_Cmd         =   CB_WAIT0;
  } else if (current->cb_Cmd==CB_WAIT0) {
    if(current->cmdTimeOut>0) {
      current->cmdTimeOut--;
    } else {
      //sendRecieveNParse();
      current->bComplete     = 1;
    }
  } else if (current->cb_Cmd==CB_WAIT1) {
    SOF();
    if(current->cmdTimeOut>0) {
      current->cmdTimeOut--;
    } else {
      sendRecieveNParse();
      current->wires_last_state = READ_BOTH_PINS>>8;
      current->bComplete     = 1;
    }
  } else if (current->cb_Cmd==CB_POWER) {
    // for TEST
    #ifdef TEST
      SOF();
      sendRecieve();
      SOF();
      SOF();
    #else
      SET_O;
      SE_J;
      SET_I;
#ifdef MSX_SOFT_USB
      /* USB devices need at least 10 ms recovery after reset is removed. */
      current->cmdTimeOut  =   10;
#else
      current->cmdTimeOut  =    2;
#endif
      current->cb_Cmd  = CB_WAIT1;
    #endif
  } else if (current->cb_Cmd==CB_TICK) {
    SOF();
    current->bComplete     =         1;
  } else if(current->cb_Cmd==CB_3) {
    SOF();
    pu_Addr(current->rq.cmd,current->rq.addr,current->rq.eop);
    pu_Cmd(current->rq.dataCmd, current->rq.bmRequestType, current->rq.bmRequest,current->rq.wValue, current->rq.wIndex, current->rq.wLen);
    int res = sendRecieve();
    if(res==T_ACK) {
      current->cb_Cmd=CB_4;
      current->numb_reps_errors_allowed = 8;
      return ;
    } else {
      current->numb_reps_errors_allowed--;
      if(current->numb_reps_errors_allowed>0) {
        return ;
      } else {
        current->cb_Cmd=CB_TICK;
        current->bComplete = 1;
      }
    }
  } else if(current->cb_Cmd==CB_4) {
    SOF();
    pu_Addr(T_OUT,current->rq.addr,current->rq.eop);
    //reB();
    pu_MSB(T_START,8);
    pu_MSB(T_DATA1,8);//setup
    for(int k=0;k<current->transmitL1Bytes;k++) {
      pu_LSB(current->transmitL1[k],8);
    }
    pu_MSB(cal16(),16);
    repack();
    sendRecieveNParse();
    pu_Addr(T_IN,current->rq.addr,current->rq.eop);
    //setup
    sendRecieveNParse();
    if(received_NRZI_buffer_bytesCnt<SMALL_NO_DATA &&  received_NRZI_buffer_bytesCnt >SMALL_NO_DATA/4) {
      ACK();
    } else {
      current->numb_reps_errors_allowed--;
      if(current->numb_reps_errors_allowed>0) {
        return;
      } else {

      }
    }
    current->cb_Cmd=CB_TICK;
    current->bComplete = 1;
  } else if(current->cb_Cmd==CB_5) {
    SOF();
    pu_Addr(current->rq.cmd,current->rq.addr,current->rq.eop);
    pu_Cmd(current->rq.dataCmd, current->rq.bmRequestType, current->rq.bmRequest,current->rq.wValue, current->rq.wIndex, current->rq.wLen);
    sendRecieveNParse();

    int res = parse_received_NRZI_buffer();
#ifdef MSX_SOFT_USB
    current->lastCaptureEdges = received_NRZI_buffer_bytesCnt;
    current->lastControlResult = res;
    current->lastControlCommand = CB_5;
    if(res == T_ACK) ++current->setupAcks;
    else {
      ++current->controlFailures;
      memcpy(current->lastControlTrace, received_NRZI_buffer,
             (received_NRZI_buffer_bytesCnt < 24 ? received_NRZI_buffer_bytesCnt : 24) * sizeof(uint16_t));
    }
#endif
    if(res==T_ACK) {
      current->cb_Cmd = CB_6;
      current->in_data_flip_flop = 1;
      current->numb_reps_errors_allowed = 4;
      current->counterAck ++;
      return ;
    } else {
      //SOF();
      current->counterNAck ++;
      current->numb_reps_errors_allowed--;
      if(current->numb_reps_errors_allowed>0) {
        // current->cb_Cmd = CB_TICK;
        current->acc_decoded_resp_counter = 0;
        return ;
      } else {
        current->cb_Cmd = CB_TICK;
        current->bComplete       =  1;
      }
    }
  } else if(current->cb_Cmd==CB_6) {
    SOF();
    pu_Addr(T_IN,current->rq.addr,current->rq.eop);
    //setup
    sendRecieveNParse();
#ifdef MSX_SOFT_USB
    int res = parse_received_NRZI_buffer();
    current->lastCaptureEdges = received_NRZI_buffer_bytesCnt;
    current->lastControlResult = res;
    current->lastControlCommand = CB_6;
    if(res == T_NEED_ACK) {
      unsigned size = decoded_receive_buffer_size();
      decoded_receive_buffer_get();
      unsigned pid = decoded_receive_buffer_get();
      if(pid != (current->in_data_flip_flop & 1 ? T_DATA1 : T_DATA0)) return;
      unsigned bytes = size - 4;
      if(bytes > (unsigned)current->asckedReceiveBytes ||
         bytes > 255U - current->acc_decoded_resp_counter) {
        current->acc_decoded_resp_counter = 0;
        current->numb_reps_errors_allowed = 0;
        current->cb_Cmd = CB_TICK;
        current->bComplete = 1;
        return;
      }
      ++current->in_data_flip_flop;
      for(unsigned i = 0; i < bytes; ++i)
        current->acc_decoded_resp[current->acc_decoded_resp_counter++] = rev8(decoded_receive_buffer_get());
      current->asckedReceiveBytes -= bytes;
      current->numb_reps_errors_allowed = 4;
      current->cb_Cmd = CB_7;
    } else {
      ++current->controlFailures;
      if(--current->numb_reps_errors_allowed <= 0) {
        current->cb_Cmd = CB_TICK;
        current->bComplete = 1;
      }
    }
#else
    // if receive something ??
    if(current->asckedReceiveBytes==0 && current->acc_decoded_resp_counter==0 && received_NRZI_buffer_bytesCnt<SMALL_NO_DATA &&  received_NRZI_buffer_bytesCnt >SMALL_NO_DATA/4 ) {
      ACK();

      current->cb_Cmd = CB_TICK;
      current->bComplete       =  1;
      return ;
    }
    int res = parse_received_NRZI_buffer();
    if(res == T_NEED_ACK) {
      //SOF();
      if(decoded_receive_buffer_size()>2) {
        decoded_receive_buffer_get();
        uint8_t sval = decoded_receive_buffer_get();
        if((current->in_data_flip_flop&1)==1) {
          if(sval==T_DATA1) {

          } else {
            current->cb_Cmd = CB_7;
            return ;
          }
        } else {
          if(sval==T_DATA0) {

          } else {
            current->cb_Cmd = CB_7;
            return ;
          }
        }
        current->in_data_flip_flop++;
        int bytes =decoded_receive_buffer_size()-2;
        for(int kk=0;kk<bytes;kk++) {
          current->acc_decoded_resp[current->acc_decoded_resp_counter] = rev8(decoded_receive_buffer_get());
          current->acc_decoded_resp_counter++;
          current->asckedReceiveBytes--;
        }

        if(bytes<=0) {

          current->acc_decoded_resp_counter = 0;
          current->asckedReceiveBytes = 0;
          current->cb_Cmd = CB_TICK;
          current->bComplete = 1;
        } else {
          current->cb_Cmd = CB_7;
          return ;
        }
      } else {
        current->acc_decoded_resp_counter = 0;
        current->asckedReceiveBytes = 0;
        current->cb_Cmd = CB_TICK;
        current->bComplete = 1;
        return ;
      }
    } else {
      current->numb_reps_errors_allowed--;
      if(current->numb_reps_errors_allowed>0) {
        return ;
      } else {
        current->cb_Cmd = CB_TICK;
        current->bComplete = 1;
      }
    }
#endif
  } else if(current->cb_Cmd==CB_7) {
    SOF();
    pu_Addr(T_IN,current->rq.addr,current->rq.eop);
    //setup
#ifdef MSX_SOFT_USB
    msxAcknowledgeReplay = true;
    sendRecieveNParse();
    msxAcknowledgeReplay = false;
    if(!msxReplayAcked) {
      if(--current->numb_reps_errors_allowed > 0) return;
      current->acc_decoded_resp_counter = 0;
      current->cb_Cmd = CB_TICK;
      current->bComplete = 1;
      return;
    }
    if(!current->rq.wLen) {
      current->cb_Cmd = CB_TICK;
      current->bComplete = 1;
      return;
    }
#else
    sendRecieveNParse();
    ACK();
#endif
    if(current->asckedReceiveBytes>0) {
      current->cb_Cmd = CB_6;
      return ;
    }
    current->cb_Cmd = CB_8;
  } else if(current->cb_Cmd==CB_8) {
    SOF();
    pu_Addr(T_OUT,current->rq.addr,current->rq.eop);
    pu_ShortCmd(T_DATA1);
    sendOnly();
    current->cb_Cmd = CB_TICK;
    current->bComplete = 1;
  } else if(current->cb_Cmd==CB_2Ack) {
    SOF();
    pu_Addr(T_IN,current->rq.addr,current->rq.eop);
    //setup
#ifdef MSX_SOFT_USB
    msxAcknowledgeReplay = true;
    sendRecieveNParse();
    msxAcknowledgeReplay = false;
    if(!msxReplayAcked) {
      if(--current->numb_reps_errors_allowed > 0) return;
      current->acc_decoded_resp_counter = 0;
    } else if(current->acc_decoded_resp_counter) {
      current->inputToggle[current->inputIndex] ^= 1;
    }
#else
    sendRecieveNParse();
    if(received_NRZI_buffer_bytesCnt<SMALL_NO_DATA/2) {
      // no data , seems NAK or something like this
      current->cb_Cmd = CB_TICK;
      current->bComplete = 1;
      return ;
     }
    ACK();
#endif
    current->cb_Cmd = CB_TICK;
    current->bComplete = 1;
  } else if(current->cb_Cmd==CB_2) {
    SOF();
    pu_Addr(T_IN,current->rq.addr,current->rq.eop);
    //setup
    sendRecieveNParse();
    if(received_NRZI_buffer_bytesCnt<SMALL_NO_DATA/2) {
      // no data , seems NAK or something like this
      current->cb_Cmd = CB_TICK;
      current->bComplete = 1;
      return ;
    }
    int res = parse_received_NRZI_buffer();
    if(res==T_NEED_ACK) {
#ifdef MSX_SOFT_USB
      int count = decoded_receive_buffer_size();
      if(count >= 4 && count <= 12) {
        decoded_receive_buffer_get();
        uint8_t pid = decoded_receive_buffer_get();
        int bytes = count - 4;
        uint8_t expected = current->inputToggle[current->inputIndex] ? T_DATA1 : T_DATA0;
        if((pid == T_DATA0 || pid == T_DATA1) && bytes <= current->asckedReceiveBytes) {
          if(pid == expected) {
            for(int k=0; k<bytes; ++k)
              current->acc_decoded_resp[k] = rev8(decoded_receive_buffer_get());
            current->acc_decoded_resp_counter = bytes;
          }
          current->cb_Cmd = CB_2Ack;
          current->numb_reps_errors_allowed = 4;
          return;
        }
      }
      current->asckedReceiveBytes = 0;
      current->cb_Cmd = CB_TICK;
      current->bComplete = 1;
      return;
#else
      if(decoded_receive_buffer_size()>2) {
        decoded_receive_buffer_get();
        decoded_receive_buffer_get();
        int bytes =decoded_receive_buffer_size()-2;
        for(int kk=0;kk<bytes;kk++) {
          current->acc_decoded_resp[current->acc_decoded_resp_counter] = rev8(decoded_receive_buffer_get());
          current->acc_decoded_resp_counter++;
          current->asckedReceiveBytes--;
        }
      }
      current->asckedReceiveBytes = 0;
      current->cb_Cmd=CB_2Ack;
      return ;
#endif
    } else {
      current->numb_reps_errors_allowed--;
      if(current->numb_reps_errors_allowed>0) {
        return ;
      } else {
        current->cb_Cmd = CB_TICK;
        current->bComplete = 1;
      }
    }
    current->cb_Cmd = CB_TICK;
    current->bComplete = 1;
    current->asckedReceiveBytes = 0;
  }
}



