cristianoag/esp32_clones/software/esp32_msx_emulator/lib/MsxSoftUsb/upstream/usb_host.c
void Request( uint8_t cmd, uint8_t addr, uint8_t eop, uint8_t dataCmd,uint8_t bmRequestType, uint8_t bmRequest, uint16_t wValue, uint16_t wIndex, uint16_t wLen, uint16_t waitForBytes)
{
  current->rq.cmd  = cmd;
  current->rq.addr = addr;
  current->rq.eop  = eop;
  current->rq.dataCmd = dataCmd;
  current->rq.bmRequestType = bmRequestType;
  current->rq.bmRequest = bmRequest;
  current->rq.wValue = wValue;
  current->rq.wIndex = wIndex;
  current->rq.wLen = wLen;

  current->numb_reps_errors_allowed = 4;
  current->asckedReceiveBytes = waitForBytes;
  current->acc_decoded_resp_counter = 0;
  current->cb_Cmd = CB_5;
}



void RequestSend( uint8_t cmd, uint8_t addr, uint8_t eop, uint8_t dataCmd, uint8_t bmRequestType, uint8_t bmRequest, uint16_t wValue, uint16_t wIndex, uint16_t wLen, uint16_t transmitL1Bytes, uint8_t* data)
{
  current->rq.cmd  = cmd;
  current->rq.addr = addr;
  current->rq.eop  = eop;
  current->rq.dataCmd = dataCmd;
  current->rq.bmRequestType = bmRequestType;
  current->rq.bmRequest = bmRequest;
  current->rq.wValue = wValue;
  current->rq.wIndex = wIndex;
  current->rq.wLen = wLen;
  current->transmitL1Bytes = transmitL1Bytes;
  for(int k=0;k<current->transmitL1Bytes;k++) {
    current->transmitL1[k] = data[k];
  }
  current->numb_reps_errors_allowed = 4;
  current->acc_decoded_resp_counter = 0;
  current->cb_Cmd = CB_3;
}


void RequestIn(uint8_t cmd, uint8_t addr, uint8_t eop, uint16_t waitForBytes)
{
  current->rq.cmd  = cmd;
  current->rq.addr = addr;
  current->rq.eop  = eop;
  current->numb_reps_errors_allowed = 4;
  current->asckedReceiveBytes = waitForBytes;
  current->acc_decoded_resp_counter    = 0;
  current->cb_Cmd = CB_2;
}


void (*usbMess)(uint8_t src,uint8_t len,uint8_t *data) = NULL;
void set_usb_mess_cb( onusbmesscb_t onUSBMessCb )
{
  usbMess = onUSBMessCb;
}

#ifdef MSX_SOFT_USB
static usbrawcb_t usbRaw;
void set_usb_raw_cb(usbrawcb_t cb)
{
  usbRaw = cb;
}

// Classify applications and bound input reports without mapping their fields.
static bool msxIsGamepadReport(const uint8_t *data, unsigned length)
{
  uint32_t page = 0, usage = 0, usagePage = 0, pages[4];
  uint32_t reportSize = 0, reportCount = 0, sizes[4], counts[4];
  uint8_t reportId = 0, ids[4], inputBits[256] = {0};
  unsigned stack = 0, depth = 0;
  bool haveUsage = false, gamepad = false, hasIds = false;
  for(unsigned pos=0; pos<length;) {
    uint8_t prefix = data[pos++];
    // Long items have no supported semantics here. Reject before reading any
    // long-item header/payload, including truncated ones.
    if(prefix == 0xfe) return false;
    unsigned size = prefix & 3;
    if(size == 3) size = 4;
    if(size > length - pos) return false;
    uint32_t value = 0;
    for(unsigned i=0; i<size; ++i) value |= (uint32_t)data[pos++] << (8*i);
    unsigned type = (prefix >> 2) & 3;
    unsigned tag = prefix >> 4;
    if(type == 1) {
      if(tag == 0) page = value;
      else if(tag == 7) reportSize = value;
      else if(tag == 8) {
        if(size != 1 || !value || inputBits[0]) return false;
        reportId = value;
        hasIds = true;
      } else if(tag == 9) reportCount = value;
      else if(tag == 10) {
        if(size || stack == 4) return false;
        sizes[stack] = reportSize;
        counts[stack] = reportCount;
        ids[stack] = reportId;
        pages[stack++] = page;
      } else if(tag == 11) {
        if(size || !stack) return false;
        page = pages[--stack];
        reportSize = sizes[stack];
        reportCount = counts[stack];
        reportId = ids[stack];
      }
    } else if(type == 2 && tag == 0) {
      usage = size == 4 ? value & 0xffff : value;
      usagePage = size == 4 ? value >> 16 : page;
      haveUsage = true;
    } else if(type == 0) {
      if(tag == 8) {
        if(!depth || (hasIds && !reportId)) return false;
        unsigned budget = reportId ? 56 : 64;
        if(reportSize && reportCount > (budget - inputBits[reportId]) / reportSize)
          return false;
        inputBits[reportId] += reportSize * reportCount;
      } else if(tag == 10) {
        if(size != 1) return false;
        if(!depth) {
          if(value != 1 || !haveUsage || usagePage != 1 || (usage != 4 && usage != 5))
            return false;
          gamepad = true;
        } else if(value == 1) {
          return false;
        }
        ++depth;
      } else if(tag == 12) {
        if(!depth || size) return false;
        --depth;
      }
      haveUsage = false;
    }
  }
  return gamepad && !depth && !stack;
}
#endif



void (*onConfigDescCb)(uint8_t ref, int cfgCount, void *lcfg, size_t len);
void set_onconfigdesc_cb( onconfigdesccb_t cb )
{
  onConfigDescCb = cb;
}


void (*onIfaceDescCb)(uint8_t ref, int cfgCount, int sIntfCount, void* sIntf, size_t len);
void set_onifacedesc_cb( onifacedesccb_t cb )
{
  onIfaceDescCb = cb;
}


void (*onHIDDevDescCb)(uint8_t ref, int cfgCount, int sIntfCount, int hidCount, void*hid, size_t len);
void set_onhiddevdesc_cb( onhiddevdesccb_t cb )
{
  onHIDDevDescCb = cb;
}


void (*onEPDescCb)(uint8_t ref, int cfgCount, int epdCount, void*epd, size_t len);
void set_onepdesc_cb( onepdesccb_t cb )
{
  onEPDescCb = cb;
}


void (*onDetectCB)(uint8_t usbNum, void *device) = NULL;
void set_ondetect_cb( ondetectcb_t cb )
{
  onDetectCB = cb;
}

void (*onDisconnectCB)( uint8_t usbNum ) = NULL;
void set_ondisconnect_cb( ondisconnectcb_t cb )
{
  onDisconnectCB = cb;
}

void (*onLedBlinkCB)(int on_off) = NULL;
void set_onled_blink_cb( onledblinkcb_t cb )
{
  onLedBlinkCB = cb;
}


void fsm_Mashine()
{
  if(!current->bComplete) return;
  current->bComplete = 0;

  if(current->fsm_state == 0) {
    current->epCount   = 0;
#ifdef MSX_SOFT_USB
    current->inputCount = 0;
    current->reportDescriptorLength = 0;
    current->ufPrintDesc = 0;
    memset(current->inputToggle, 0, sizeof(current->inputToggle));
    memset(current->inputDue, 0, sizeof(current->inputDue));
#endif
    current->cb_Cmd    = CB_CHECK;
    current->fsm_state = 1;
  }
  if(current->fsm_state == 1) {
    if(current->wires_last_state==M_ONE) { // if(1)
      current->cmdTimeOut = 100+current->selfNum*73;
      current->cb_Cmd     = CB_WAIT0;
      current->fsm_state  = 2;
    } else {
      current->fsm_state  = 0;
      current->cb_Cmd     = CB_CHECK;
    }
  } else if(current->fsm_state==2) {
    current->cb_Cmd       = CB_RESET;
    current->fsm_state    = 3;
  } else if(current->fsm_state==3) {
    current->cb_Cmd       = CB_POWER;
    #ifdef TEST
      current->fsm_state  =  3;
    #else
      current->fsm_state  =  4;
    #endif
  } else if(current->fsm_state==4) {
    Request(T_SETUP,ZERO_USB_ADDRESS,0b0000,T_DATA0,0x80,0x6,0x0100,0x0000,0x0012,0x0012);
    current->fsm_state    = 5;
  } else if(current->fsm_state==5) {
    if(current->acc_decoded_resp_counter==0x12) {
      memcpy(&current->desc,current->acc_decoded_resp,0x12);
#ifdef MSX_SOFT_USB
      if(current->desc.bLength != 18 || current->desc.bDescriptorType != 1 ||
         current->desc.bMaxPacketSize0 != 8 || !current->desc.bNumConfigurations) {
        current->fsm_state = 104;
        current->cb_Cmd = CB_TICK;
        return;
      }
#endif
      current->ufPrintDesc |= 1;
    } else {
      if(current->numb_reps_errors_allowed<=0) {
        current->fsm_state = 0;
        return;
      }
    }

    Request(T_SETUP,ZERO_USB_ADDRESS,0b0000,T_DATA0,0x00,0x5,0x0000+ASSIGNED_USB_ADDRESS,0x0000,0x0000,0x0000);
    current->fsm_state    =  6;

