cristianoag/esp32_clones/software/esp32_msx_emulator/lib/MsxSoftUsb/upstream/usb_host.c
  } else if(current->fsm_state==6) {
    current->cmdTimeOut = 5;
    current->cb_Cmd     = CB_WAIT1;
    current->fsm_state  = 7;
  } else if(current->fsm_state==7) {
    Request(T_SETUP,ASSIGNED_USB_ADDRESS,0b0000,T_DATA0,0x80,0x6,0x0200,0x0000,0x0009,0x0009);
    current->fsm_state  = 8;
  } else if(current->fsm_state==8) {
    if(current->acc_decoded_resp_counter==0x9) {
      memcpy(&current->cfg,current->acc_decoded_resp,0x9);
#ifdef MSX_SOFT_USB
      // The inherited control accumulator and descriptor length are eight-bit.
      if(current->cfg.wLength < 9 || current->cfg.wLength > 255) {
        current->fsm_state = 104;
        return;
      }
#endif
      current->ufPrintDesc |= 2;
      Request(T_SETUP,ASSIGNED_USB_ADDRESS,0b0000,T_DATA0,0x80,0x6,0x0200,0x0000,current->cfg.wLength,current->cfg.wLength);
      current->fsm_state = 9;
    } else {
      current->fsm_state = 0;
      return;
    }
  } else if(current->fsm_state==9) {
    if(current->acc_decoded_resp_counter==current->cfg.wLength) {
      current->ufPrintDesc |= 4;
      current->descrBufferLen = current->acc_decoded_resp_counter;
      memcpy(current->descrBuffer,current->acc_decoded_resp,current->descrBufferLen);
      current->fsm_state  = 97;
    } else {
      current->cmdTimeOut = 5;
      current->cb_Cmd     = CB_WAIT1;
      current->fsm_state  = 7;
    }
  } else if(current->fsm_state==97) {
#ifdef MSX_SOFT_USB
    // Let the task parse the complete configuration before enabling polling.
    if(current->ufPrintDesc & 4) {
      current->cb_Cmd = CB_TICK;
      return;
    }
    if(!current->inputCount || !current->reportDescriptorLength) {
      current->fsm_state = 104;
      current->cb_Cmd = CB_TICK;
      return;
    }
    Request(T_SETUP,ASSIGNED_USB_ADDRESS,0,T_DATA0,0x00,0x9,current->cfg.bCV,0,0,0);
#else
    Request(T_SETUP,ASSIGNED_USB_ADDRESS,0b0000,T_DATA0,0x00,0x9,0x0001,0x0000,0x0000,0x0000);
#endif
    current->fsm_state    = 98;
  } else if(current->fsm_state==98) {
#ifdef MSX_SOFT_USB
    if(current->numb_reps_errors_allowed <= 0) {
      current->inputCount = 0;
      current->fsm_state = 104;
      current->cb_Cmd = CB_TICK;
      return;
    }
    Request(T_SETUP,ASSIGNED_USB_ADDRESS,0,T_DATA0,0x81,0x6,0x2200,
            current->inputInterface,current->reportDescriptorLength,current->reportDescriptorLength);
    current->fsm_state = 90;
#else
    // config interfaces??
    Request(T_SETUP,ASSIGNED_USB_ADDRESS,0b0000,T_DATA0,0x21,0xa,0x0000,0x0000,0x0000,0x0000);
    current->fsm_state    = 99;
#endif
#ifdef MSX_SOFT_USB
  } else if(current->fsm_state==90) {
    if(current->numb_reps_errors_allowed <= 0 ||
       current->acc_decoded_resp_counter != current->reportDescriptorLength ||
       !msxIsGamepadReport(current->acc_decoded_resp, current->acc_decoded_resp_counter)) {
      current->inputCount = 0;
      current->fsm_state = 104;
      current->cb_Cmd = CB_TICK;
      return;
    }
    if(onDetectCB) onDetectCB(current->selfNum, &current->desc);
    current->fsm_state = 100;
    current->cb_Cmd = CB_TICK;
  } else if(current->fsm_state==100) {
    if(current->wires_last_state != M_ONE) {
      current->fsm_state = 0;
      current->cb_Cmd = CB_CHECK;
      return;
    }
    for(uint8_t i=0; i<current->inputCount; ++i) {
      uint8_t slot = (current->inputIndex + i) % current->inputCount;
      if((int32_t)(current->tick - current->inputDue[slot]) < 0) continue;
      current->inputIndex = slot;
      current->inputDue[slot] = current->tick + current->inputInterval[slot];
      RequestIn(T_IN, ASSIGNED_USB_ADDRESS, current->inputEndpoint[slot] & 15, current->inputSize[slot]);
      current->fsm_state = 101;
      return;
    }
    current->cmdTimeOut = 0;
    current->cb_Cmd = CB_WAIT1;
  } else if(current->fsm_state==101) {
    if(current->acc_decoded_resp_counter && current->acc_decoded_resp_counter <= 8 && usbRaw)
      usbRaw(current->selfNum, current->inputEndpoint[current->inputIndex],
             current->acc_decoded_resp_counter, current->acc_decoded_resp);
    current->inputIndex = (current->inputIndex + 1) % current->inputCount;
    current->fsm_state = 100;
    current->cmdTimeOut = 0;
    current->cb_Cmd = CB_WAIT1;
  } else if(current->fsm_state==104) {
    // Unsupported device: remain electrically idle until unplugged.
    current->cb_Cmd = CB_CHECK;
    if(current->wires_last_state != M_ONE) current->fsm_state = 0;
#else
  } else if(current->fsm_state==99) {
    if(current->flags_new!=current->flags) {
      current->flags = current->flags_new;
      RequestSend(T_SETUP,ASSIGNED_USB_ADDRESS,0b0000,T_DATA0,0x21,0x9,0x0200,0x0000,0x0001,0x0001,&current->flags);
    }
    current->fsm_state    = 100;
  } else if(current->fsm_state==100) {
     if( onLedBlinkCB ) onLedBlinkCB(0);
     RequestIn(T_IN,  ASSIGNED_USB_ADDRESS,1,8);
     current->fsm_state    = 101;
  } else if(current->fsm_state==101) {
    if(current->acc_decoded_resp_counter>=1) {
      usbMess(current->selfNum*4+0,current->acc_decoded_resp_counter,current->acc_decoded_resp);
      if( onLedBlinkCB ) onLedBlinkCB(1);
    }
    if(current->epCount>=2) {
      RequestIn(T_IN,  ASSIGNED_USB_ADDRESS,2,8);
      current->fsm_state  = 102;
    } else {
      current->cmdTimeOut = 3;
      current->cb_Cmd     = CB_WAIT1;
      current->fsm_state  = 104;
    }
  } else if(current->fsm_state==102) {
    if(current->acc_decoded_resp_counter>=1) {
      usbMess(current->selfNum*4+1,current->acc_decoded_resp_counter,current->acc_decoded_resp);
      if( onLedBlinkCB ) onLedBlinkCB(1);
    }
    current->cmdTimeOut = 2;
    current->cb_Cmd     = CB_WAIT1;
    current->fsm_state  = 104;
  } else if (current->fsm_state==104) {
    current->cmdTimeOut = 4;
    current->cb_Cmd     = CB_WAIT1;
  #ifdef  DEBUG_REPEAT
    static int rcnt =0;
    rcnt++;  //
    if(  (rcnt&0xff)==0 ||  (current->wires_last_state!=M_ONE))
  #else
    if(current->wires_last_state!=M_ONE)
  #endif
    {
      current->fsm_state  = 0;
      return ;
    }
    current->fsm_state  = 99;
  } else {
    current->cmdTimeOut = 2;
    current->cb_Cmd     = CB_WAIT1;
    current->fsm_state  = 0;
  }
#endif
#ifdef MSX_SOFT_USB
  } else {
    current->fsm_state = 0;
    current->cb_Cmd = CB_CHECK;
  }
#endif
}



void IRAM_ATTR setPins(int DPPin,int DMPin)
{
  DP_PIN = DPPin;
  DM_PIN = DMPin;
  int diff = DPPin - DMPin;
  if(abs(diff)>7) {
    printf("PIN DIFFERENCE MUST BE LESS THAN 8!\n");
    return;
  }
  int MIN_PIN = (DPPin<DMPin)?DPPin:DMPin;

  DM_PIN_M   = (1 << DMPin);
  DP_PIN_M    = (1 << DPPin);
  RD_MASK    = (1<<DPPin)|(1<<DMPin);

