cristianoag/esp32_clones/software/esp32_msx_emulator/lib/MsxSoftUsb/upstream/usb_host.c
  RD_SHIFT = MIN_PIN;
  M_ONE = 1<<(DM_PIN-MIN_PIN);
  P_ONE = 1<<(DP_PIN-MIN_PIN);

}


sUsbContStruct  current_usb[NUM_USB];

#ifdef MSX_SOFT_USB
void msx_usb_reset(void)
{
  for(unsigned port=0; port<NUM_USB; ++port) {
    current = &current_usb[port];
    if(!current->isValid) continue;
    setPins(current->DP, current->DM);
    SET_I;
    current->connected = false;
    current->wires_last_state = 0;
    current->fsm_state = 0;
    current->cb_Cmd = CB_CHECK;
    current->bComplete = 1;
    current->cmdTimeOut = 0;
    current->ufPrintDesc = 0;
    current->acc_decoded_resp_counter = 0;
    current->asckedReceiveBytes = 0;
    current->inputCount = 0;
    current->epCount = 0;
  }
}
#endif


int checkPins(int dp,int dm)
{
  int diff = abs(dp-dm);
  if( dp<0 || dm < 0 ) return 0;

  if(diff>7||diff==0) {
    printf("Diff not in [1-7] range: %d (%d-%d)\n", diff, dp, dm );
    return 0;
  }

  if( dp<8 || dp>31) {
    printf("WARN: Dp not in [8-31] range: [%d]\n", dp );
    return 0;
  }
  if( dm<8 || dm>31) {
    printf("WARN: Dm not in [8-31] range: [%d]\n", dp );
    return 0;
  }

  return 1;
}


int64_t get_system_time_us()
{
  struct timeval tv;
  gettimeofday(&tv, NULL);
  return (tv.tv_sec * 1000000LL + (tv.tv_usec ));
}


#ifndef MSX_SOFT_USB
float testDelay6(float freq_MHz)
{
  // 6 bits must take 4.0 uSec
  #define SEND_BITS 120
  #define REPS      40
  float res = 1;
  transmit_NRZI_buffer_cnt = 0;

  for(int k=0;k<SEND_BITS/2;k++) {
    transmit_NRZI_buffer[transmit_NRZI_buffer_cnt++] = USB_LS_K;
    transmit_NRZI_buffer[transmit_NRZI_buffer_cnt++] = USB_LS_J;
  }

  int64_t stimb = get_system_time_us();
  for(int k=0;k<REPS;k++) {
    sendOnly();
    transmit_NRZI_buffer_cnt = SEND_BITS;
  }

  uint32_t stim =  get_system_time_us()- stimb;
  freq_MHz = 1.0f;
  res = stim*6.0/freq_MHz/(SEND_BITS*REPS);
  printf("%d bits in %f uSec %f MHz  6 ticks in %f uS\n",(SEND_BITS*REPS),stim/(float)freq_MHz,(SEND_BITS*REPS)*freq_MHz/stim,stim*6.0/freq_MHz/(SEND_BITS*REPS));

  return res;
}
#endif

uint8_t arr[0x200];


void setupGPIO( int pin )
{
  gpio_pad_select_gpio( pin );
  gpio_set_direction( pin , GPIO_MODE_OUTPUT);
  gpio_set_level( pin , 0);
  gpio_set_direction( pin , GPIO_MODE_INPUT);
  gpio_pulldown_en( pin );
}





void initStates(int DP0,int DM0,int DP1,int DM1,int DP2,int DM2,int DP3,int DM3)
{
#ifdef MSX_SOFT_USB
  msxTimingValid = false;
#endif
  decoded_receive_buffer_head = 0;
  decoded_receive_buffer_tail = 0;
  transmit_bits_buffer_store_cnt = 0;

  int calibrated = 0;

  for(int k=0;k<NUM_USB;k++) {

    current = &current_usb[k];

    if(k==0) {
      current->DP = DP0;
      current->DM = DM0;
    } else if(k==1) {
      current->DP = DP1;
      current->DM = DM1;
    } else if(k==2) {
      current->DP = DP2;
      current->DM = DM2;
    } else if(k==3) {
      current->DP = DP3;
      current->DM = DM3;
    }

    current->isValid = 0;

    if(checkPins(current->DP,current->DM)) {

      printf("USB#%d (pins %d %d) is OK!\n", k, current->DP, current->DM );

      current->selfNum           = k;
      current->flags_new         = 0x0;
      current->flags 		         = 0x0;
      current->in_data_flip_flop = 0;
      current->bComplete         = 1;
      current->cmdTimeOut        = 0;
      current->ufPrintDesc       = 0;
      current->cb_Cmd            = CB_CHECK;
      current->fsm_state         = 0;
      current->wires_last_state  = 0;
      current->counterNAck       = 0;
      current->counterAck        = 0;
      current->epCount           = 0;
      current->connected         = false;

      setupGPIO( current->DP );
      setupGPIO( current->DM );

      current->isValid = 1;

      // TEST
      setPins(current->DP,current->DM);
      printf("READ_BOTH_PINS = %04x\n",READ_BOTH_PINS);
      SET_O;
      SE_0;
      SE_J;
      SE_0;
      SET_I;
      printf("READ_BOTH_PINS = %04x\n",READ_BOTH_PINS);
      gpio_set_direction(current->DP, GPIO_MODE_OUTPUT);
      gpio_set_direction(current->DM, GPIO_MODE_OUTPUT);
      printf("READ_BOTH_PINS = %04x\n",READ_BOTH_PINS);
      SET_I;
      printf("READ_BOTH_PINS = %04x\n",READ_BOTH_PINS);

      if(!calibrated) {
        //calibrate delay divide 2
        #define DELAY_CORR 2
        int  uTime = 254;
        int  dTime = 0;

        rtc_cpu_freq_config_t  out_config;

        rtc_clk_cpu_freq_get_config(&out_config);
        printf("cpu freq = %d MHz\n",out_config.freq_mhz);

        TM_OUT = out_config.freq_mhz/2;

        // 8  - func divided clock to 8, 1.5 - MHz USB LS
        TIME_MULT = (int)( TIME_SCALE / ( out_config.freq_mhz/8/1.5 ) + 0.5 );
        printf("TIME_MULT = %d \n",TIME_MULT);

#ifdef MSX_SOFT_USB
        msxBitCycles = msx_usb_bit_cycles(out_config.freq_mhz);
        msxTimingValid = msxBitCycles != 0;
        if(msxTimingValid)
          printf("MSX joystick USB: cycle-timed TX, %lu cycles/bit at %u MHz (target 1.5 Mbit/s)\n",
                 (unsigned long)msxBitCycles, out_config.freq_mhz);
        else
          printf("MSX joystick USB: unsupported CPU clock %u MHz for cycle-timed TX\n", out_config.freq_mhz);
        calibrated = 1;
        if(msxTimingValid) {
          transmit_NRZI_buffer_cnt = 0;
          pu_MSB(T_START, 8);
          pu_MSB(T_ACK, 8);
          repack();
          ACK_BUFF_CNT = transmit_NRZI_buffer_cnt;
          memcpy(ACK_BUFF, transmit_NRZI_buffer, ACK_BUFF_CNT);
          restart();
        }
#else
        int TRANSMIT_TIME_DELAY_OPT = 0;
        TRANSMIT_TIME_DELAY = TRANSMIT_TIME_DELAY_OPT;
        printf( "D=%4d ", TRANSMIT_TIME_DELAY );
        setCPUDelay( TRANSMIT_TIME_DELAY );
        float  cS_opt = testDelay6( out_config.freq_mhz );

        #define OPT_TIME (4.00f)
        for( int p=0;p<15;p++ ) {
          TRANSMIT_TIME_DELAY = (uTime+dTime)/2;
          printf( "D=%4d ", TRANSMIT_TIME_DELAY );
          setCPUDelay( TRANSMIT_TIME_DELAY );
          float cS = testDelay6( out_config.freq_mhz );
          if( fabsf( OPT_TIME-cS )< fabsf( OPT_TIME-cS_opt ) ) {
            cS_opt = cS;
            TRANSMIT_TIME_DELAY_OPT = TRANSMIT_TIME_DELAY;
          }
          if( cS<OPT_TIME ) {
            dTime = TRANSMIT_TIME_DELAY;
          } else {
            uTime = TRANSMIT_TIME_DELAY;
          }
        }
        TRANSMIT_TIME_DELAY = TRANSMIT_TIME_DELAY_OPT+DELAY_CORR;
        setCPUDelay( TRANSMIT_TIME_DELAY );
        printf( "TRANSMIT_TIME_DELAY = %d time = %f error = %f%% \n", TRANSMIT_TIME_DELAY, cS_opt, (cS_opt-OPT_TIME)/OPT_TIME*100 );
#endif
      }
    } else {
      if( current->DP == -1 && current->DM == -1 ) {
        printf( "USB#%d is disabled by user configuration\n", k );
      } else {
        printf( "USB#%d (pins %d %d) has errors and will be disabled !\n", k, current->DP, current->DM );
      }
    }
  }
}



void usbSetFlags(int _usb_num,uint8_t flags)
{
  if(_usb_num<NUM_USB&&_usb_num>=0) {
    current_usb[_usb_num].flags_new =  flags;
  }
}



