cristianoag/esp32_clones/software/esp32_msx_emulator/lib/MsxSoftUsb/upstream/usb_host.c
uint8_t usbGetFlags(int _usb_num)
{
  if(_usb_num<NUM_USB&&_usb_num>=0) {
    return current_usb[_usb_num].flags;
  }
  return  0;
}



void IRAM_ATTR usb_process()
{
  #if CONFIG_IDF_TARGET_ESP32C3 || defined ESP32C3
    cpu_ll_enable_cycle_count();
  #endif
  for(int k=0;k<NUM_USB;k++) {
    current = &current_usb[k];
    if(current->isValid) {
#ifdef MSX_SOFT_USB
      ++current->tick;
#endif
      setPins(current->DP,current->DM);
      timerCallBack();
      fsm_Mashine();
      
    }
  }
}


// called from timer task
void printState()
{
  static int cntl = 0;
  cntl++;
  int ref = cntl%NUM_USB;
  sUsbContStruct * pcurrent = &current_usb[ref];
  if(!pcurrent->isValid) return;
#ifdef MSX_SOFT_USB
  if(!pcurrent->connected) pcurrent->unsupportedLogged = false;
  if(pcurrent->controlFailures != pcurrent->loggedControlFailures &&
     pcurrent->loggedControlFailures < 8) {
    pcurrent->loggedControlFailures = pcurrent->controlFailures;
    printf("MSX joystick USB port %u: control cmd=%u result=%02x (%s) edges=%u setup-acks=%u\n",
           ref + 1, pcurrent->lastControlCommand, pcurrent->lastControlResult,
           pcurrent->lastControlResult == T_ACK ? "ACK" :
           pcurrent->lastControlResult == T_NACK ? "NAK" :
           pcurrent->lastControlResult == T_STALL ? "STALL" :
           pcurrent->lastControlResult == T_CHK_ERR ? "CRC/decode error" :
           pcurrent->lastCaptureEdges <= 1 ? "no reply" : "unrecognized reply",
           pcurrent->lastCaptureEdges, pcurrent->setupAcks);
    if(pcurrent->loggedControlFailures <= 2 && pcurrent->lastControlCommand == CB_5) {
      printf("MSX joystick USB RX edges:");
      for(unsigned i = 0; i < pcurrent->lastCaptureEdges && i < 24; ++i)
        printf(" %04x", pcurrent->lastControlTrace[i]);
      printf("\n");
    }
  }
  if(pcurrent->connected && pcurrent->fsm_state != 100 && pcurrent->fsm_state != 101 &&
     (int32_t)(pcurrent->tick - pcurrent->nextDiagnostic) >= 0) {
    pcurrent->nextDiagnostic = pcurrent->tick + 5000;
    printf("MSX joystick USB port %u: enumeration state=%u command=%u received=%u retries=%d wires=%04x\n",
           ref + 1, pcurrent->fsm_state, pcurrent->cb_Cmd,
           pcurrent->acc_decoded_resp_counter, pcurrent->numb_reps_errors_allowed,
           pcurrent->wires_last_state);
  }
  if(pcurrent->connected && !pcurrent->unsupportedLogged &&
     (pcurrent->fsm_state == 104 || pcurrent->wires_last_state == P_ONE)) {
    pcurrent->unsupportedLogged = true;
    printf("MSX joystick USB port %u: %s\n", ref + 1,
           pcurrent->wires_last_state == P_ONE ? "full-speed devices are not supported" :
           "unsupported HID gamepad descriptor or failed configuration; unplug to retry");
  }
#endif
  if((cntl%800)<NUM_USB) {
    #ifdef DEBUG_ALL
      printf("USB%d: Ack=%d Nack=%d %02x pcurrent->cb_Cmd=%d  state=%d epCount=%d --",
        cntl%NUM_USB, pcurrent->counterAck,
        pcurrent->counterNAck,
        pcurrent->wires_last_state,
        pcurrent->cb_Cmd,
        pcurrent->fsm_state,
        pcurrent->epCount
      );
      for(int k=0;k<20;k++) {
        printf("%04x ", debug_buff[k]);
      }
      printf("\n");
    #endif
  }

  if( pcurrent->ufPrintDesc == 0 ) {
    static bool connected[4] = {false, false, false, false};
    if( pcurrent->connected != connected[ref] ) { // each connector has its own line state
      connected[ref] = pcurrent->connected;
      if( !pcurrent->connected ) { // track disconnect (connect is already tracked by onDetectCB)
        if( onDisconnectCB )
          onDisconnectCB( ref );
        #ifdef DEBUG_ALL
        else
          printf("USB#%d disconnected\n", ref);
        #endif
      }
    }
  }

  if(pcurrent->ufPrintDesc&1) {
    pcurrent->ufPrintDesc &= ~(uint32_t)1;
#ifdef MSX_SOFT_USB
    printf("MSX joystick USB port %u: device VID=%04x PID=%04x; reading configuration\n",
           ref + 1, pcurrent->desc.idVendor, pcurrent->desc.idProduct);
#else
    if( onDetectCB ) {
      onDetectCB( ref, (void*)&pcurrent->desc );
    } else {
      printf("desc.bcdDevice       = %02x\n",pcurrent->desc.bcdDevice);
      printf("desc.iManufacturer   = %02x\n",pcurrent->desc.iManufacturer);
      printf("desc.iProduct        = %02x\n",pcurrent->desc.iProduct);
      printf("desc.iSerialNumber   = %02x\n",pcurrent->desc.iSerialNumber);
      printf("desc.bNumConfigurations = %02x\n",pcurrent->desc.bNumConfigurations);
    }
#endif
  }

  if(pcurrent->ufPrintDesc&2) {
    pcurrent->ufPrintDesc &= ~(uint32_t)2;
  }

  if(pcurrent->ufPrintDesc&4) {
    pcurrent->ufPrintDesc &= ~(uint32_t)4;
#ifdef MSX_SOFT_USB
    // Select one nonboot HID interface. Application usages are checked after
    // SET_CONFIGURATION; report layouts remain opaque to calibration.
    int selectedInterface = -1;
    bool acceptInterface = false;
    bool malformed = false;
    pcurrent->inputCount = 0;
    pcurrent->inputIndex = 0;
    for(unsigned pos=0; pos<pcurrent->descrBufferLen;) {
      const uint8_t *d = pcurrent->descrBuffer + pos;
      unsigned remaining = pcurrent->descrBufferLen - pos;
      if(remaining < 2 || d[0] < 2 || d[0] > remaining) {
        malformed = true;
        break;
      }
      if(d[1] == 4) {
        if(d[0] < 9) { malformed = true; break; }
        acceptInterface = d[3] == 0 && d[5] == HIDCLASS &&
                          d[6] == 0 && d[7] == 0 &&
                          (selectedInterface < 0 || selectedInterface == d[2]);
        if(acceptInterface) {
          selectedInterface = d[2];
          pcurrent->inputInterface = d[2];
        }
      } else if(d[1] == 0x21 && acceptInterface) {
        if(d[0] < 6 || d[0] < 6 + 3*d[5]) { malformed = true; break; }
        for(unsigned i=0; i<d[5]; ++i) {
          if(d[6+3*i] != 0x22) continue;
          unsigned length = d[7+3*i] | ((unsigned)d[8+3*i] << 8);
          if(!length || length > 255) { malformed = true; break; }
          pcurrent->reportDescriptorLength = length;
        }
      } else if(d[1] == 5 && acceptInterface) {
        if(d[0] < 7) { malformed = true; break; }
        unsigned size = d[4] | ((unsigned)d[5] << 8);
        if((d[2] & 0x80) && !(d[2] & 0x70) && (d[2] & 15) &&
           (d[3] & 3) == 3 && size > 0 && size <= 8 && d[6]) {
          if(pcurrent->inputCount == 4) { malformed = true; break; }
          unsigned slot = pcurrent->inputCount++;
          pcurrent->inputEndpoint[slot] = d[2];
          pcurrent->inputSize[slot] = size;
          pcurrent->inputInterval[slot] = d[6] < 10 ? 10 : d[6];
        }
      }
      pos += d[0];
    }
    if(malformed || (pcurrent->desc.bDeviceClass != STDCLASS &&
                     pcurrent->desc.bDeviceClass != HIDCLASS))
      pcurrent->inputCount = 0;
#else
    int cfgCount   = 0;
    int sIntfCount = 0;
    int hidCount   = 0;
    //int epCount    = 0;
    int pos = 0;
    #ifdef DEBUG_ALL
      printf("clear epCount %d self = %d\n",pcurrent->epCount,pcurrent->selfNum);
    #endif
    pcurrent->epCount     = 0;
    while(pos<pcurrent->descrBufferLen-2) {
      uint8_t len  =  pcurrent->descrBuffer[pos];
      uint8_t type =  pcurrent->descrBuffer[pos+1];
      if(len==0) {
        pos = pcurrent->descrBufferLen;
      }
      if(pos+len<=pcurrent->descrBufferLen) {
        //printf("\n");
        if(type == 0x2) {
          // Config Descriptor
          cfgCount++;
          if(onConfigDescCb) onConfigDescCb(ref, cfgCount, &pcurrent->descrBuffer[pos], len);
          else {
            #ifdef DEBUG_ALL
              sCfgDesc *lcfg = (sCfgDesc*)&pcurrent->descrBuffer[pos];
              printf("Config Descriptor #%d\n", cfgCount);
              printf("  cfg.wLength         = 0x%02x\n", lcfg->wLength);
              printf("  cfg.bNumIntf        = 0x%02x\n", lcfg->bNumIntf);
              printf("  cfg.bCV             = 0x%02x\n", lcfg->bCV);
              printf("  cfg.bMaxPower       = %d\n",     lcfg->bMaxPower);
            #endif
          }
        } else if (type == 0x4) {
          // Interface Descriptor
          sIntfCount++;
          if(onIfaceDescCb) onIfaceDescCb(ref, cfgCount, sIntfCount, &pcurrent->descrBuffer[pos], len);
          else {
            #ifdef DEBUG_ALL
              sIntfDesc *sIntf = (sIntfDesc*)&pcurrent->descrBuffer[pos];
              printf("    Interface Descriptor #%d\n", sIntfCount);
              printf("      sIntf.bLength     = 0x%02x\n", sIntf->bLength);
              printf("      sIntf.bType       = 0x%02x\n", sIntf->bType);
              printf("      sIntf.iNum        = 0x%02x\n", sIntf->iNum);
              printf("      sIntf.iAltString  = 0x%02x\n", sIntf->iAltString);
              printf("      sIntf.bEndPoints  = 0x%02x\n", sIntf->bEndPoints);
              printf("      sIntf.iClass      = 0x%02x\n", sIntf->iClass);
              printf("      sIntf.iSub        = 0x%02x\n", sIntf->iSub);
              printf("      sIntf.iProto      = 0x%02x\n", sIntf->iProto);
              printf("      sIntf.iIndex      = 0x%02x\n", sIntf->iIndex);
            #endif
          }
        } else if (type == 0x21) {
          // iInterface (HID Device Descriptor)
          hidCount++;
          if(onHIDDevDescCb) onHIDDevDescCb(ref, cfgCount, sIntfCount, hidCount, &pcurrent->descrBuffer[pos], len);
          else {
            #ifdef DEBUG_ALL
              HIDDescriptor *hid = (HIDDescriptor*)&pcurrent->descrBuffer[pos];
              printf("        HID Device Descriptor #%d\n", hidCount);
              printf("          hid.bLength               = 0x%02x\n", hid->bLength);
              printf("          hid.bDescriptorType       = 0x%02x\n", hid->bDescriptorType);
              printf("          hid.bcdHID                = 0x%02x\n", hid->bcdHID);
              printf("          hid.bCountryCode          = 0x%02x\n", hid->bCountryCode);
              printf("          hid.bNumDescriptors       = 0x%02x\n", hid->bNumDescriptors);
              printf("          hid.bReportDescriptorType = 0x%02x\n", hid->bReportDescriptorType);
              printf("          hid.wItemLengthL          = 0x%02x\n", hid->wItemLengthL);
              printf("          hid.wItemLengthH          = 0x%02x\n", hid->wItemLengthH);
            #endif
          }
        } else if (type == 0x5) {
          // EndPoint Descriptor
          pcurrent->epCount++;
          if(onEPDescCb) onEPDescCb(ref, cfgCount, pcurrent->epCount, &pcurrent->descrBuffer[pos], len);
          else {
            #ifdef DEBUG_ALL
              sEPDesc *epd = (sEPDesc*)&pcurrent->descrBuffer[pos];
              printf("      EndPoint Descriptor #%d\n", pcurrent->epCount);
              printf("        epd.bLength       = 0x%02x\n", epd->bLength);
              printf("        epd.bType         = 0x%02x\n", epd->bType);
              printf("        epd.bEPAdd        = 0x%02x\n", epd->bEPAdd);
              printf("        epd.bAttr         = 0x%02x\n", epd->bAttr);
              printf("        epd.wPayLoad      = 0x%02x\n", epd->wPayLoad);
              printf("        epd.bInterval     = 0x%02x\n", epd->bInterval);
            #endif
          }
        }
      }
      pos+=len;
    }
#endif
  }
}


#pragma GCC diagnostic pop
